# LAB 04 - Data Preprocessing 2

## 4. 그룹집계

### #01. 준비작업

In [1]:
# 1. 라이브러리 참조하기:
from hossam import load_data

In [2]:
# 2. 데이터 불러오기:
origin = load_data("traffic_acc")
origin

[data] https://data.hossam.kr/data/lab04/traffic_acc.xlsx
[desc] 2025년 1월 부터 2018년 12월 까지 월별 교통사고의 발생건수,부상자수,사망자수 데이터(인덱스/메타데이터 없음, 출처: 공공데이터포털)
[!] Cannot read metadata

       년도   월   발생건수  사망자수   부상자수
0    2005   1  15494   504  25413
1    2005   2  13244   431  21635
2    2005   3  16580   477  25550
3    2005   4  17817   507  28131
4    2005   5  19085   571  29808
..    ...  ..    ...   ...    ...
163  2018   8  18335   357  27749
164  2018   9  18371   348  27751
165  2018  10  19738   373  28836
166  2018  11  19029   298  28000
167  2018  12  18010   323  26463

[168 rows x 5 columns]

### #02. 지정된 컬럼을 기준으로 그룹화

In [3]:
# 1. 전체 컬럼에 대한 집계: .groupby()
# - 지정된 컬럼을 기준으로 같은 값을 갖는 행을 그룹으로 묶고 
#   지정되지 않은 컬럼에 대한 집계 함수를 명시해야 한다.
#   -> 아래 결과에서는 '월'도 합계를 구한다
#   -> 집계 전 제외해야 하는 컬럼은 drop()을 사용하서 삭제하거나 
#      집계에 포함되야 하는 항목들만 filter()로 추출 후 
#      groupby()를 적용하는 것이 바람직함
origin.groupby('년도').sum()

       월    발생건수  사망자수    부상자수
년도
2005  78  214171  6376  342233
2006  78  213745  6327  340229
2007  78  211662  6166  335906
2008  78  215822  5870  338962
2009  78  231990  5838  361875
2010  78  226878  5505  352458
2011  78  221711  5229  341391
2012  78  223656  5392  344565
2013  78  215354  5092  328711
2014  78  223552  4762  337497
2015  78  232035  4621  350400
2016  78  220917  4292  331720
2017  78  216335  4185  322829
2018  78  217148  3781  323037

In [ ]:
# 집계함수 종류: numpy나 series 객체가 갖는 함수랑 동일함
    # sum, mean, median, max, min, std, var..
    # new ones: unique(고유값), nunique(고유값 갯수), 
    #           prod(곱), first(첫째값), last(마지막값)

In [4]:
# 2. 불필요한 컬럼을 제외해야 하는 경우:

# 1) 월 컬럼을 삭제한 새로운 데이터프레임 생성
df = origin.drop(columns = '월')
df

       년도   발생건수  사망자수   부상자수
0    2005  15494   504  25413
1    2005  13244   431  21635
2    2005  16580   477  25550
3    2005  17817   507  28131
4    2005  19085   571  29808
..    ...    ...   ...    ...
163  2018  18335   357  27749
164  2018  18371   348  27751
165  2018  19738   373  28836
166  2018  19029   298  28000
167  2018  18010   323  26463

[168 rows x 4 columns]

In [5]:
# 2) 새로운 데이터 프레임을 활용한 데이터 집계
df.groupby('년도').sum()

        발생건수  사망자수    부상자수
년도
2005  214171  6376  342233
2006  213745  6327  340229
2007  211662  6166  335906
2008  215822  5870  338962
2009  231990  5838  361875
2010  226878  5505  352458
2011  221711  5229  341391
2012  223656  5392  344565
2013  215354  5092  328711
2014  223552  4762  337497
2015  232035  4621  350400
2016  220917  4292  331720
2017  216335  4185  322829
2018  217148  3781  323037

### #03. 필요한 컬럼만 추출하여 집계하는 경우

In [6]:
# 1. 년도와 교통사고 사망자 수만 추출:
df = df.filter(['년도', '사망자수'])
df

       년도  사망자수
0    2005   504
1    2005   431
2    2005   477
3    2005   507
4    2005   571
..    ...   ...
163  2018   357
164  2018   348
165  2018   373
166  2018   298
167  2018   323

[168 rows x 2 columns]

In [7]:
# 2. 추출된 새로운 데이터프레임을 활용한 집계:
df.groupby('년도').sum()

      사망자수
년도
2005  6376
2006  6327
2007  6166
2008  5870
2009  5838
2010  5505
2011  5229
2012  5392
2013  5092
2014  4762
2015  4621
2016  4292
2017  4185
2018  3781

### #04. 두개 이상의 변수에 대한 그룹화

In [8]:
# 1. 그룸화 할 기준이 두개 이상일 경우:
# - 리스트로 묶어서 설정한다 -> 인덱스가 두개 이상으로 떨어진다!
origin.groupby(['년도', '월']).mean()

            발생건수   사망자수     부상자수
년도   월
2005 1   15494.0  504.0  25413.0
     2   13244.0  431.0  21635.0
     3   16580.0  477.0  25550.0
     4   17817.0  507.0  28131.0
     5   19085.0  571.0  29808.0
...          ...    ...      ...
2018 8   18335.0  357.0  27749.0
     9   18371.0  348.0  27751.0
     10  19738.0  373.0  28836.0
     11  19029.0  298.0  28000.0
     12  18010.0  323.0  26463.0

[168 rows x 3 columns]

In [9]:
# 2. 컬럼별로 집계함수를 다르게 지정해야 하는 경우: .agg({'컬럼명': '함수', ...})
# - agg() 함수에 {컬럼: 함수명} 형식의 딕셔너리를 전달한다
#   -> 특정 함수에 두개 이상의 함수를 적용할 경우, 
#      함수 이름을 리스트로 묶음 (함수를 문자열 취급함!)
origin.drop('월', axis=1).groupby('년도').agg(
    {
        '발생건수': ['mean', 'sum'],
        '사망자수': 'max',
        '부상자수': 'min'
    }
)

              발생건수         사망자수   부상자수
              mean     sum  max    min
년도
2005  17847.583333  214171  639  21635
2006  17812.083333  213745  701  22903
2007  17638.500000  211662  582  23717
2008  17985.166667  215822  574  23282
2009  19332.500000  231990  592  24429
2010  18906.500000  226878  619  24968
2011  18475.916667  221711  520  22493
2012  18638.000000  223656  533  25998
2013  17946.166667  215354  499  22255
2014  18629.333333  223552  476  21501
2015  19336.250000  232035  470  22999
2016  18409.750000  220917  440  24021
2017  18027.916667  216335  420  22323
2018  18095.666667  217148  373  24630

### #05. 사용자 정의 함수를 사용한 집계

In [10]:
# 1. 사용자 정의 함수 적용:
# origin.drop(columns = '월').groupby('년도').agg(myFunction)
# -> 컬럼 하나가 통째로 시리즈 객체로 myFunction(x)의 x 자리에 들어온다!
def myFunction(x):
    # x는 시리즈 객체, 컬럼 하나가 통째로 전달됨!
    return x.max() - x.min()

# 사용자 정의 함수 이름은 문자열 아님!
origin.drop('월', axis=1).groupby('년도').agg(['max', 'min', myFunction])

       발생건수                   사망자수                   부상자수
        max    min myFunction  max  min myFunction    max    min myFunction
년도
2005  19757  13244       6513  639  431        208  31603  21635       9968
2006  19877  14270       5607  701  373        328  31270  22903       8367
2007  19264  14696       4568  582  446        136  30532  23717       6815
2008  19926  14176       5750  574  423        151  30935  23282       7653
2009  21440  15502       5938  592  405        187  33255  24429       8826
2010  21575  15803       5772  619  395        224  33282  24968       8314
2011  20952  14208       6744  520  338        182  32133  22493       9640
2012  19750  16656       3094  533  393        140  30163  25998       4165
2013  19797  14187       5610  499  335        164  29676  22255       7421
2014  20760  14061       6699  476  325        151  31199  21501       9698
2015  21587  14939       6648  470  296        174  32436  22999       9437
2016  19918  15664       4254  440  292        148  29635  24021       5614
2017  19891  14832       5059  420  280        140  29371  22323       7048
2018  19738  16208       3530  373  266        107  28836  24630       4206

In [15]:
# 2. 람다식 적용:
# 집계할 때 마다 늘 함수 정의하기 귀찮으면 '람다식 적용(함수 축약형)' ㄱㄱ
origin.drop('월', axis=1).groupby('년도').agg(['max', 'min', myFunction]).agg(['max', 'min', lambda x : x.max() - x.min()])

           발생건수                   사망자수                   부상자수         \
            max    min myFunction  max  min myFunction    max    min
max       21587  16656       6744  701  446        328  33282  25998
min       19264  13244       3094  373  266        107  28836  21501
<lambda>   2323   3412       3650  328  180        221   4446   4497


         myFunction
max            9968
min            4165
<lambda>       5803

### #06. 인덱스 지정 해제

In [16]:
# groupby() 메서드에서 사용한 필드(변수)는 결과 집합의 인덱스로 지정되는 것이 기본형태임
# - groupby() 메서드에 as_index=False 옵션을 추가하면 인덱스 지정을 방지할 수 있음
origin.drop('월', axis=1).groupby('년도', as_index=False).sum()

      년도    발생건수  사망자수    부상자수
0   2005  214171  6376  342233
1   2006  213745  6327  340229
2   2007  211662  6166  335906
3   2008  215822  5870  338962
4   2009  231990  5838  361875
5   2010  226878  5505  352458
6   2011  221711  5229  341391
7   2012  223656  5392  344565
8   2013  215354  5092  328711
9   2014  223552  4762  337497
10  2015  232035  4621  350400
11  2016  220917  4292  331720
12  2017  216335  4185  322829
13  2018  217148  3781  323037